Table of Contents
 Class IdeaNode
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaNode : AbstractIdeaObject<IIdeaNode>, IEquatable<AbstractIdeaObject<IIdeaNode>>, IIdeaNode, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaNode>
IdeaNode
Implements
IEquatable<AbstractIdeaObject<IIdeaNode>>
IIdeaNode
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaNode>.Id
 AbstractIdeaObject<IIdeaNode>.Name
 AbstractIdeaObject<IIdeaNode>.Identifier
 AbstractIdeaObject<IIdeaNode>.GetHashCode()
 AbstractIdeaObject<IIdeaNode>.Equals(object)
 AbstractIdeaObject<IIdeaNode>.Equals(AbstractIdeaObject<IIdeaNode>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaNode(Identifier<IIdeaNode>)
public IdeaNode(Identifier<IIdeaNode> identifer)
Parameters
identifer Identifier<IIdeaNode>
 IdeaNode(int)
public IdeaNode(int id)
Parameters
id int
 IdeaNode(string)
public IdeaNode(string id)
Parameters
id string
Properties
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Vector
public virtual IdeaVector3D Vector { get; set; }
Property Value
IdeaVector3D
 Edit this page